In [40]:
import numpy as np 
import pandas as pd 
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, Binarizer, KBinsDiscretizer
from sklearn.impute import SimpleImputer

In [13]:
# 生成初始data
data = pd.read_csv('/Users/mac/Desktop/未命名项目/test/Narrativedata.csv', index_col=0)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Sex       891 non-null    object
 2   Embarked  889 non-null    object
 3   Survived  891 non-null    object
dtypes: float64(1), object(3)
memory usage: 34.8+ KB

In [15]:
data.head()

    Age     Sex Embarked Survived
0  22.0    male        S       No
1  38.0  female        C      Yes
2  26.0  female        S      Yes
3  35.0  female        S      Yes
4  35.0    male        S       No

In [16]:
data.loc[:, 'Age'] = SimpleImputer().fit_transform(data.loc[:, 'Age'].values.reshape(-1, 1))

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       891 non-null    float64
 1   Sex       891 non-null    object
 2   Embarked  889 non-null    object
 3   Survived  891 non-null    object
dtypes: float64(1), object(3)
memory usage: 34.8+ KB

In [18]:
data.loc[:, 'Embarked'] = SimpleImputer(strategy='most_frequent').fit_transform(data.loc[:, 'Embarked'].values.reshape(-1, 1))

In [19]:
data = data.dropna(axis=0)

In [20]:
data.head()

    Age     Sex Embarked Survived
0  22.0    male        S       No
1  38.0  female        C      Yes
2  26.0  female        S      Yes
3  35.0  female        S      Yes
4  35.0    male        S       No

In [27]:
enc = OneHotEncoder()
enc = enc.fit(data.iloc[:, 1:-1])
result = enc.transform(data.iloc[:, 1:-1]).toarray()

In [30]:
data = data.drop(['Sex', 'Embarked'], axis=1)

In [31]:
data = pd.concat([data, pd.DataFrame(result)], axis=1)

In [32]:
data.head()

    Age Survived    0    1    2    3    4
0  22.0       No  0.0  1.0  0.0  0.0  1.0
1  38.0      Yes  1.0  0.0  1.0  0.0  0.0
2  26.0      Yes  1.0  0.0  0.0  0.0  1.0
3  35.0      Yes  1.0  0.0  0.0  0.0  1.0
4  35.0       No  0.0  1.0  0.0  0.0  1.0

In [33]:
data.columns = ['Age', 'Survived'] + enc.get_feature_names().tolist()

In [34]:
data.head()

    Age Survived  x0_female  x0_male  x1_C  x1_Q  x1_S
0  22.0       No        0.0      1.0   0.0   0.0   1.0
1  38.0      Yes        1.0      0.0   1.0   0.0   0.0
2  26.0      Yes        1.0      0.0   0.0   0.0   1.0
3  35.0      Yes        1.0      0.0   0.0   0.0   1.0
4  35.0       No        0.0      1.0   0.0   0.0   1.0

In [35]:
data.iloc[:, 1] = LabelEncoder().fit_transform(data.iloc[:, 1])

In [36]:
data.head()

    Age  Survived  x0_female  x0_male  x1_C  x1_Q  x1_S
0  22.0         0        0.0      1.0   0.0   0.0   1.0
1  38.0         2        1.0      0.0   1.0   0.0   0.0
2  26.0         2        1.0      0.0   0.0   0.0   1.0
3  35.0         2        1.0      0.0   0.0   0.0   1.0
4  35.0         0        0.0      1.0   0.0   0.0   1.0

In [37]:
# 初始data生成完毕

In [38]:
data_1 = data.copy()

In [42]:
# 二值化
transformer = Binarizer(threshold=30).fit_transform(data_1.loc[:, 'Age'].values.reshape(-1, 1))

In [45]:
data_1.loc[:, 'Age'] = transformer

In [46]:
data_1.head()

   Age  Survived  x0_female  x0_male  x1_C  x1_Q  x1_S
0  0.0         0        0.0      1.0   0.0   0.0   1.0
1  1.0         2        1.0      0.0   1.0   0.0   0.0
2  0.0         2        1.0      0.0   0.0   0.0   1.0
3  1.0         2        1.0      0.0   0.0   0.0   1.0
4  1.0         0        0.0      1.0   0.0   0.0   1.0

In [ ]:
# 分箱
transformer = KBinsDiscretizer(n_bins=3, encode='onehot', strategy='uniform').